In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    'name': ['A', 'B', 'C', 'D'],
    'marks': [91, 80, 82, 88],
    'city': ['Patna', 'Lucknow', 'Kanpur', 'Ranchi']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

  name  marks     city
0    A     91    Patna
1    B     80  Lucknow
2    C     82   Kanpur
3    D     88   Ranchi

In [5]:
df.to_csv('../data/sample.csv')